In [5]:
import numpy as np
import pandas as pd

df = pd.read_csv('HR_Analytics.csv')

df.head()

,EmpID,Age,AgeGroup,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,RM297,18,18-25,Yes,Travel_Rarely,230,Research & Development,3,3,Life Sciences,...,3,80,0,0,2,3,0,0,0,0.0
1,RM302,18,18-25,No,Travel_Rarely,812,Sales,10,3,Medical,...,1,80,0,0,2,3,0,0,0,0.0
2,RM458,18,18-25,Yes,Travel_Frequently,1306,Sales,5,3,Marketing,...,4,80,0,0,3,3,0,0,0,0.0
3,RM728,18,18-25,No,Non-Travel,287,Research & Development,5,2,Life Sciences,...,4,80,0,0,2,3,0,0,0,0.0
4,RM829,18,18-25,Yes,Non-Travel,247,Research & Development,8,1,Medical,...,4,80,0,0,0,3,0,0,0,0.0

In [6]:
df.shape

#1,480 Rows, 38 Columns

(1480, 38)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1480 entries, 0 to 1479
Data columns (total 38 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   EmpID                     1480 non-null   object
 1   Age                       1480 non-null   int64
 2   AgeGroup                  1480 non-null   object
 3   Attrition                 1480 non-null   object
 4   BusinessTravel            1480 non-null   object
 5   DailyRate                 1480 non-null   int64
 6   Department                1480 non-null   object
 7   DistanceFromHome          1480 non-null   int64
 8   Education                 1480 non-null   int64
 9   EducationField            1480 non-null   object
 10  EmployeeCount             1480 non-null   int64
 11  EmployeeNumber            1480 non-null   int64
 12  EnvironmentSatisfaction   1480 non-null   int64
 13  Gender                    1480 non-null   object
 14  HourlyRate                1480 non-null   int64
 15  JobInvolvement            1480 non-null   int64
 16  JobLevel                  1480 non-null   int64
 17  JobRole                   1480 non-null   object
 18  JobSatisfaction           1480 non-null   int64
 19  MaritalStatus             1480 non-null   object
 20  MonthlyIncome             1480 non-null   int64
 21  SalarySlab                1480 non-null   object
 22  MonthlyRate               1480 non-null   int64
 23  NumCompaniesWorked        1480 non-null   int64
 24  Over18                    1480 non-null   object
 25  OverTime                  1480 non-null   object
 26  PercentSalaryHike         1480 non-null   int64
 27  PerformanceRating         1480 non-null   int64
 28  RelationshipSatisfaction  1480 non-null   int64
 29  StandardHours             1480 non-null   int64
 30  StockOptionLevel          1480 non-null   int64
 31  TotalWorkingYears         1480 non-null   int64
 32  TrainingTimesLastYear     1480 non-null   int64
 33  WorkLifeBalance           1480 non-null   int64
 34  YearsAtCompany            1480 non-null   int64
 35  YearsInCurrentRole        1480 non-null   int64
 36  YearsSinceLastPromotion   1480 non-null   int64
 37  YearsWithCurrManager      1423 non-null   float64
dtypes: float64(1), int64(25), object(12)
memory usage: 439.5+ KB

In [8]:
df.describe()

,Age,DailyRate,DistanceFromHome,Education,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,HourlyRate,JobInvolvement,JobLevel,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
count,1480.000000,1480.000000,1480.000000,1480.000000,1480.0,1480.000000,1480.000000,1480.000000,1480.000000,1480.000000,...,1480.000000,1480.0,1480.000000,1480.000000,1480.000000,1480.000000,1480.000000,1480.000000,1480.000000,1423.000000
mean,36.917568,801.384459,9.220270,2.910811,1.0,1031.860811,2.724324,65.845270,2.729730,2.064865,...,2.708784,80.0,0.791892,11.281757,2.797973,2.760811,7.009459,4.228378,2.182432,4.118060
std,9.128559,403.126988,8.131201,1.023796,0.0,605.955046,1.092579,20.328266,0.713007,1.105574,...,1.081995,0.0,0.850527,7.770870,1.288791,0.707024,6.117945,3.616020,3.219357,3.555484
min,18.000000,102.000000,1.000000,1.000000,1.0,1.000000,1.000000,30.000000,1.000000,1.000000,...,1.000000,80.0,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,30.000000,465.000000,2.000000,2.000000,1.0,493.750000,2.000000,48.000000,2.000000,1.000000,...,2.000000,80.0,0.000000,6.000000,2.000000,2.000000,3.000000,2.000000,0.000000,2.000000
50%,36.000000,800.000000,7.000000,3.000000,1.0,1027.500000,3.000000,66.000000,3.000000,2.000000,...,3.000000,80.0,1.000000,10.000000,3.000000,3.000000,5.000000,3.000000,1.000000,3.000000
75%,43.000000,1157.000000,14.000000,4.000000,1.0,1568.250000,4.000000,83.000000,3.000000,3.000000,...,4.000000,80.0,1.000000,15.000000,3.000000,3.000000,9.000000,7.000000,3.000000,7.000000
max,60.000000,1499.000000,29.000000,5.000000,1.0,2068.000000,4.000000,100.000000,4.000000,5.000000,...,4.000000,80.0,3.000000,40.000000,6.000000,4.000000,40.000000,18.000000,15.000000,17.000000

In [9]:
#Data Cleaning

#Amend 'TravelRarely' to 'Travel_Rarely' to group together
df['BusinessTravel'] = df['BusinessTravel'].replace('TravelRarely', 'Travel_Rarely')

# Amend '55+' to '56+'
df['AgeGroup'] = df['AgeGroup'].replace('55+', '56+')

#Amend description under 'SalarySlab' column
df['SalarySlab'] = df['SalarySlab'].replace('Upto 5k', 'Up_to_5000')
df['SalarySlab'] = df['SalarySlab'].replace('5k-10k', '5001_to_10000')
df['SalarySlab'] = df['SalarySlab'].replace('10k-15k', '10001_to_15000')
df['SalarySlab'] = df['SalarySlab'].replace('15k+', 'Over_15000')

#Export 'hr_analytics_edit' as .csv file
df.to_csv("hr_analytics_edit.csv")

### Attrition

In [147]:
count_attrition = df.groupby('Attrition').size()

total_rows = len(df)

attrition_percentage = (count_attrition / total_rows) * 100

pd.DataFrame({'Count': count_attrition, 'Percentage': attrition_percentage})

           Count  Percentage
Attrition
No          1242   83.918919
Yes          238   16.081081

### Gender

In [79]:
count_gender = df.groupby('Gender').size()

total_rows = len(df)

gender_percentage = (count_gender / total_rows) * 100

pd.DataFrame({'Count': count_gender, 'Percentage': gender_percentage})

        Count  Percentage
Gender
Female    591   39.932432
Male      889   60.067568

### Age

In [14]:
df['Age'].describe()

count    1480.000000
mean       36.917568
std         9.128559
min        18.000000
25%        30.000000
50%        36.000000
75%        43.000000
max        60.000000
Name: Age, dtype: float64

### Age Group

In [15]:
count_age_group = df.groupby('AgeGroup').size()

# Total number of records in the DataFrame
total_rows = len(df)

age_group_percentage = (count_age_group / total_rows) * 100

pd.DataFrame({'Count': count_age_group, 'Percentage': age_group_percentage})

          Count  Percentage
AgeGroup
18-25       123    8.310811
26-35       611   41.283784
36-45       471   31.824324
46-55       228   15.405405
56+          47    3.175676

### Marital Status

In [80]:
count_maritalstatus = df.groupby('MaritalStatus').size()

total_rows = len(df)

maritalstatus_percentage = (count_maritalstatus / total_rows) * 100

pd.DataFrame({'Count': count_maritalstatus, 'Percentage': maritalstatus_percentage})

               Count  Percentage
MaritalStatus
Divorced         328   22.162162
Married          679   45.878378
Single           473   31.959459

### Business Travel

In [148]:
count_businesstravel = df.groupby('BusinessTravel').size()

total_rows = len(df)

businesstravel_percentage = (count_businesstravel / total_rows) * 100

pd.DataFrame({'Count': count_businesstravel, 'Percentage': businesstravel_percentage})

                   Count  Percentage
BusinessTravel
Non-Travel           151   10.202703
Travel_Frequently    279   18.851351
Travel_Rarely       1050   70.945946

### OverTime

In [210]:
count_overtime = df.groupby('OverTime').size()

total_rows = len(df)

overtime_percentage = (count_overtime / total_rows) * 100

pd.DataFrame({'Count': count_overtime, 'Percentage': overtime_percentage})

          Count  Percentage
OverTime
No         1062   71.756757
Yes         418   28.243243

### Distance From Home

In [212]:
df['DistanceFromHome'].describe()

count    1480.000000
mean        9.220270
std         8.131201
min         1.000000
25%         2.000000
50%         7.000000
75%        14.000000
max        29.000000
Name: DistanceFromHome, dtype: float64

### Education Field

In [76]:
count_educationfield = df.groupby('EducationField').size()

total_rows = len(df)

educationfield_percentage = (count_educationfield / total_rows) * 100

pd.DataFrame({'Count': count_educationfield, 'Percentage': educationfield_percentage})

                  Count  Percentage
EducationField
Human Resources      27    1.824324
Life Sciences       607   41.013514
Marketing           161   10.878378
Medical             470   31.756757
Other                83    5.608108
Technical Degree    132    8.918919

### Education

In [75]:
count_education = df.groupby('Education').size()

total_rows = len(df)

education_percentage = (count_education / total_rows) * 100

pd.DataFrame({'Count': count_education, 'Percentage': education_percentage})

#Education: 1 - High School
#Education: 2 - College
#Education: 3 - Bachelor
#Education: 4 - Master
#Education: 5 - Doctorate

           Count  Percentage
Education
1            172   11.621622
2            283   19.121622
3            578   39.054054
4            399   26.959459
5             48    3.243243

### Department

In [149]:
count_department = df.groupby('Department').size()

total_rows = len(df)

department_percentage = (count_department / total_rows) * 100

pd.DataFrame({'Count': count_department, 'Percentage': department_percentage})

                        Count  Percentage
Department
Human Resources            63    4.256757
Research & Development    967   65.337838
Sales                     450   30.405405

### Job Roles

In [78]:
count_jobrole = df.groupby('JobRole').size()

total_rows = len(df)

jobfield_percentage = (count_jobrole / total_rows) * 100

pd.DataFrame({'Count': count_jobrole, 'Percentage': jobfield_percentage})

                           Count  Percentage
JobRole
Healthcare Representative    132    8.918919
Human Resources               52    3.513514
Laboratory Technician        261   17.635135
Manager                      102    6.891892
Manufacturing Director       147    9.932432
Research Director             80    5.405405
Research Scientist           293   19.797297
Sales Executive              329   22.229730
Sales Representative          84    5.675676

### Job Level

In [218]:
count_joblevel = df.groupby('JobLevel').size()

total_rows = len(df)

joblevel_percentage = (count_joblevel / total_rows) * 100

pd.DataFrame({'Count': count_joblevel, 'Percentage': joblevel_percentage})

#Job Level 1: Entry Level
#Job Level 2: Associate
#Job Level 3: Mid-Level
#Job Level 4: Senior
#Job Level 5: Executive

          Count  Percentage
JobLevel
1           545   36.824324
2           539   36.418919
3           220   14.864865
4           107    7.229730
5            69    4.662162

### Job Role with Job Levels

In [215]:
df.groupby(['JobRole', 'JobLevel']).size()

JobRole                    JobLevel
Healthcare Representative  2            78
                           3            45
                           4             9
Human Resources            1            33
                           2            13
                           3             6
Laboratory Technician      1           200
                           2            58
                           3             3
Manager                    3            12
                           4            47
                           5            43
Manufacturing Director     2            92
                           3            45
                           4            10
Research Director          3            28
                           4            26
                           5            26
Research Scientist         1           235
                           2            57
                           3             1
Sales Executive            2           234
                           3            80
                           4            15
Sales Representative       1            77
                           2             7
dtype: int64

### Job Involvement

In [217]:
count_jobinvolvement = df.groupby('JobInvolvement').size()

total_rows = len(df)

jobinvolvement_percentage = (count_jobinvolvement / total_rows) * 100

pd.DataFrame({'Count': count_jobinvolvement, 'Percentage': jobinvolvement_percentage})

#Job Involvement: 1 - Low
#Job Involvement: 2 - Medium
#Job Involvement: 3 - High
#Job Involvement: 4 - Very High

                Count  Percentage
JobInvolvement
1                  83    5.608108
2                 381   25.743243
3                 869   58.716216
4                 147    9.932432

### Number of Companies Worked

In [258]:
df['NumCompaniesWorked'].describe()

count    1480.000000
mean        2.687162
std         2.494098
min         0.000000
25%         1.000000
50%         2.000000
75%         4.000000
max         9.000000
Name: NumCompaniesWorked, dtype: float64

### Compensation

In [17]:
df['HoursWorked'] = df['DailyRate'] / df['HourlyRate']
df[['HourlyRate', 'DailyRate', 'MonthlyRate', 'MonthlyIncome', 'HoursWorked']].sort_values(by='HoursWorked', ascending=False)

#Ignore variables as salary rates between hours, daily, and monthly do not converted propertly
#Impossible that an employee can work up to 50 hours a day...

      HourlyRate  DailyRate  MonthlyRate  MonthlyIncome  HoursWorked
1361          30       1490        10310          16555    49.666667
744           30       1480        15062           2088    49.333333
1339          30       1456        25796           7484    48.533333
1328          30       1421         9490          17856    47.366667
1468          32       1420        21922          18844    44.375000
...          ...        ...          ...            ...          ...
998           84        118        11262           4639     1.404762
687           96        130        16612           2022     1.354167
985           84        107        11591           6852     1.273810
951           87        105        15302          19431     1.206897
917           99        117         5355          17068     1.181818

[1480 rows x 5 columns]

### Salary Slab

In [209]:
count_salaryslab = df.groupby('SalarySlab').size()

total_rows = len(df)

salaryslab_percentage = (count_salaryslab / total_rows) * 100

pd.DataFrame({'Count': count_salaryslab, 'Percentage': salaryslab_percentage})

                Count  Percentage
SalarySlab
10001_to_15000    150   10.135135
5001_to_10000     444   30.000000
Over_15000        133    8.986486
Up_to_5000        753   50.878378

### Stock Level Option

In [81]:
count_stockoptionlevel = df.groupby('StockOptionLevel').size()

total_rows = len(df)

stockoptionlevel_percentage = (count_stockoptionlevel / total_rows) * 100

pd.DataFrame({'Count': count_stockoptionlevel, 'Percentage': stockoptionlevel_percentage})

#Stock Option Level: 0 - None
#Stock Option Level: 1 - Basic
#Stock Option Level: 2 - Intermediate
#Stock Option Level: 3 - Advanced

                  Count  Percentage
StockOptionLevel
0                   636   42.972973
1                   601   40.608108
2                   158   10.675676
3                    85    5.743243

### Percent Salary Hike

In [83]:
df.groupby(['PercentSalaryHike']).size()

PercentSalaryHike
11    211
12    199
13    210
14    203
15    102
16     78
17     83
18     90
19     77
20     56
21     48
22     56
23     28
24     21
25     18
dtype: int64

In [12]:
df['PercentSalaryHike'].describe()

count    1480.000000
mean       15.210135
std         3.655338
min        11.000000
25%        12.000000
50%        14.000000
75%        18.000000
max        25.000000
Name: PercentSalaryHike, dtype: float64

### Performance Rating

In [216]:
count_performancerating = df.groupby('PerformanceRating').size()

total_rows = len(df)

performancerating_percentage = (count_performancerating / total_rows) * 100

pd.DataFrame({'Count': count_performancerating, 'Percentage': performancerating_percentage})

#Performance Rating: 3 - Meets Expectations
#Performance Rating: 4 - Exceeds Expectations

                   Count  Percentage
PerformanceRating
3                   1253   84.662162
4                    227   15.337838

### Satisfaction Scores

In [224]:
df.groupby('EnvironmentSatisfaction').size()

EnvironmentSatisfaction
1    284
2    291
3    454
4    451
dtype: int64

In [225]:
df.groupby('JobSatisfaction').size()

JobSatisfaction
1    293
2    282
3    444
4    461
dtype: int64

In [226]:
df.groupby('RelationshipSatisfaction').size()

RelationshipSatisfaction
1    279
2    307
3    460
4    434
dtype: int64

In [228]:
#1 - Very Dissatisfied
#2 - Dissatisfied
#3 - Satisfied
#4 - Very Satisfied

### Years

In [229]:
df['TotalWorkingYears'].describe()

count    1480.000000
mean       11.281757
std         7.770870
min         0.000000
25%         6.000000
50%        10.000000
75%        15.000000
max        40.000000
Name: TotalWorkingYears, dtype: float64

In [230]:
df['TrainingTimesLastYear'].describe()

count    1480.000000
mean        2.797973
std         1.288791
min         0.000000
25%         2.000000
50%         3.000000
75%         3.000000
max         6.000000
Name: TrainingTimesLastYear, dtype: float64

In [231]:
df['YearsAtCompany'].describe()

count    1480.000000
mean        7.009459
std         6.117945
min         0.000000
25%         3.000000
50%         5.000000
75%         9.000000
max        40.000000
Name: YearsAtCompany, dtype: float64

In [232]:
df['YearsInCurrentRole'].describe()

count    1480.000000
mean        4.228378
std         3.616020
min         0.000000
25%         2.000000
50%         3.000000
75%         7.000000
max        18.000000
Name: YearsInCurrentRole, dtype: float64

In [233]:
df['YearsSinceLastPromotion'].describe()

count    1480.000000
mean        2.182432
std         3.219357
min         0.000000
25%         0.000000
50%         1.000000
75%         3.000000
max        15.000000
Name: YearsSinceLastPromotion, dtype: float64

In [264]:
df['YearsWithCurrManager'].describe()

count    1423.000000
mean        4.118060
std         3.555484
min         0.000000
25%         2.000000
50%         3.000000
75%         7.000000
max        17.000000
Name: YearsWithCurrManager, dtype: float64